import React, { useRef, useState } from 'react'
import './About.scss'

export const About = () => {
    const [aboutExpanded, setAboutExpanded] = useState(false)
    const contentRef = useRef()

    return (
        <section className='about'>
            <h2>Yabko is a Ukrainian chain of Apple original equipment stores</h2>
            <div className={aboutExpanded ? 'text text_gradient' : 'text '}
                ref={contentRef}
                style={aboutExpanded
                    ? { height: contentRef.current.scrollHeight + "px" }
                    : { height: "150px" }}>
                <p>
                    Ми розпочали свій шлях на українському ринку ще в далекому 2014-му році.
                    За такий тривалий час нам вдалось сформувати команду професійних продавців-консультантів та висококласних сервісних інженерів.
                    А також круту ком’юніті постійних клієнтів та партнерів.
                </p>
                <p>
                    Ми цінуємо вашу довіру, тому завжди готові допомогти, надати консультацію чи пораду щодо покупки.
                    Клієнти — це перш за все наші друзі. І, як відомо, для друзів лише все найкраще!
                </p>
                <h3>
                    Чому саме Ябко?
                </h3>
                <p>
                    Купувати техніку та аксесуари в Ябко — максимально просто, вигідно, зручно та безпечно.
                    У нас тисячі задоволених клієнтів по всій Україні та безліч відгуків на різних платформах.
                    Ми гарантуємо висококласний рівень обслуговування та лише позитивні емоції від покупок.
                </p>
                <p>
                    Усе, що ви бачите на полицях наших магазинів та у каталозі сайту — гарантовано 100% оригінальний якісний продукт Apple.
                    Якщо вам треба придбати, обміняти, відремонтувати, доповнити аксесуарами будь-що із техніки Епл — вам до нас!
                </p>
                <h3>
                    Ябко — це ідеальне місце, де ви завжди можете придбати:
                </h3>
                <span>
                    — Флагманські смартфони iPhone. <br />
                    — Професійні планшети iPad.<br />
                    — Потужні ноутбуки MacBook.<br />
                    — Розумні годинники Apple Watch.<br />
                    — Безпровідні навушники AirPods.<br />
                    — Оригінальні аксесуари від Apple.<br />
                </span>
                <p>
                    Ми знайдемо для вас саме ту бажану модель з потрібним кольором, обсягом пам’яті за вигідною вартістю та з офіційною гарантією на техніку Епл.
                    Для вашого комфорту і безпеки — одразу «запакуємо» обновку в оригінальний Silicone Case, поклеїмо захисне скло або плівку, підберемо павербанк.
                </p>
                <div className='gradient'>
                </div>
            </div>
            {
                !aboutExpanded &&
                <div className='more'>
                    <button onClick={() => setAboutExpanded(true)}>
                        Read more
                    </button>
                </div>
            }
        </section>
    )
}
